tap "anomalyco/tap"
tap "homebrew/services"
tap "manaflow-ai/cmux"
tap "minio/stable"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sdkman/tap"
tap "smudge/smudge"
tap "tw93/tap"
tap "typewhisper/tap"
tap "virtuslab/scala-cli"
brew "aom"
brew "xz"
brew "openjdk@21"
brew "apache-spark"
brew "ca-certificates"
brew "azure-cli"
brew "bazel"
brew "cargo-c"
brew "cmake"
brew "curl"
brew "duckdb"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "gradle@7"
brew "webp"
brew "imagemagick"
brew "jpeg-xl"
brew "pandoc"
brew "jupyterlab"
brew "lazygit"
brew "libass"
brew "minio-warp"
brew "mole"
brew "mono"
brew "mosquitto"
brew "openblas"
brew "numpy"
brew "openvino"
brew "pango"
brew "parquet-cli"
brew "pcre"
brew "postgresql@14", restart_service: :changed
brew "python@3.12"
brew "redis"
brew "ruby"
brew "rust"
brew "sfml"
brew "starship"
brew "tesseract"
brew "yarn"
brew "ykman"
brew "zig"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
brew "smudge/smudge/nightlight"
brew "virtuslab/scala-cli/scala-cli"
cask "adoptopenjdk"
cask "nikitabobko/tap/aerospace"
cask "android-platform-tools"
cask "claude-code@latest"
cask "cmux"
cask "copilot-cli"
cask "dotnet-sdk"
cask "ghostty"
cask "gyroflow"
cask "handbrake-app"
cask "prince"
cask "sioyek"
cask "slack"
cask "slimhud"
cask "syntax-highlight"
cask "typewhisper/tap/typewhisper"
cask "wave"
cask "wkhtmltopdf"
cask "yaak"
cask "zed"
cask "zen"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "frhtylcn.pythonsnippets"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "htmlhint.vscode-htmlhint"
vscode "humao.rest-client"
vscode "huntertran.auto-markdown-toc"
vscode "jmkrivocapich.drawfolderstructure"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "openai.openai-chatgpt-adhoc"
vscode "oracle.oracle-java"
vscode "pflannery.vscode-versionlens"
vscode "pgourlain.erlang"
vscode "pkief.material-icon-theme"
vscode "prime31.zig"
vscode "rooveterinaryinc.roo-cline"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "valentjn.vscode-ltex"
vscode "vscjava.vscode-gradle"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "ziglang.vscode-zig"
cargo "kitty"
